app/Models/ModelBuku.php

    public function Buku()
    {
        return $this->db->table('buku')
        ->join('kategori','kategori.id_kategori = buku.id_kategori', 'left')
        ->orderBy('id_buku', 'DESC')
        ->limit(12)
        ->get()->getResultArray();
---
SELECT *
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
ORDER BY `id_buku` DESC
 LIMIT 12