app/Models/ModelAuth.php

    public function Daftar($data)
    {
        $this->db->table('user')->insert($data);
---
INSERT INTO `user` (`username`, `password`, `email`, `alamat`, `nomer_telpon`, `verifikasi`) VALUES ('ronyparulian', '123', 'ronyparulian@gmail.com', 'JL.Tajur', '089529122827', '0')

    public function LoginAnggota($username, $password)
    {
        return  $this->db->table('user')
            ->where([
                'username' => $username,
                'password' => $password,
            ])->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = 'ronyparulian'
AND `password` = '123'